{"__ATTN__": "Do not edit this file; changes belong in the appropriate YAML file.", "depends_on": [], "overview": "A pragma specifies how a rendering engine should process its input.\nThey function as an in-band form of command-line option, specifying\nbehavior. In some cases they specify global behavior, while in other\ncases they only affect a local section. They do not perform any\naction in the language itself, but rather only a change in the\nbehavior of the rendering engine.\n\nPragmas are classified according to the first word in their tag, where\na word is defined as any string of non-space characters. This\nspecification reserves and will only define pragmas whose first word\ndoes not contain upper-case characters.  Pragmas whose first word does\nnot contain lower-case characters are reserved for use by individual\nimplementations, while words containing both are reserved for future use.\n", "tests": [{"data": {}, "desc": "The tag includes one or more strings of digits, separated by\nperiods; for example 1 or 1.0 or 1.0.1.  The first set of digits\nspecifies the major release of the spec expected by a template.\nSubsequent sets of digits specify minor releases, patches, etc.\nA major release number is required, the rest default to zero.\n\nIf the rendering engine cannot interpret tags according to the\nspecified major release of the spec, it SHOULD halt operation.\n\nIf the rendering engine cannot interpret tags according to the\nspecified or later minor release or patch level, it SHOULD halt\noperation.\n", "expected": "", "name": "The Version Pragma", "template": "{{% version 1}}"}, {"data": {}, "desc": "The tag includes one or more strings of characters, separated by\ncommas and optional white-space.  Each string indicates a section\nof the spec that the template expects the rendering engine to\nsupport.  Leading '~' characters are not required and are ignored\nif present; this allows optional portions of the spec to become\nrequired in later versions.  Required portions of the spec are\nallowed, as they may become deprecated in later versions.\n\nOfficial portions of the spec will be named using only lower-case\ncharacters.  A rendering engine is allowed to define private specs.\nThese should use only upper-case characters in their name.\n\nIf the rendering engine cannot conform to a spec, it SHOULD halt\noperation.\n", "expected": "", "name": "The Requires Pragma", "template": "{{% requires sections, partials }}"}, {"data": {}, "desc": "The remainder of the tag should be displayed, if possible, on an\nout-of-band channel reserved for error messages.\n", "expected": "", "name": "The Warn Pragma", "template": "{{% warn *** DRAFT:  DO NOT DISTRIBUTE *** }}"}, {"data": {}, "desc": "The remainder of the tag should be displayed, if possible, on an\nout-of-band channel reserved for error messages.  Next, the rendering\nengine SHOULD halt operation.\n", "expected": "", "name": "The Die Pragma", "template": "{{% die Required data is missing or not defined. }}"}, {"data": {"html": "<&>", "section": true}, "desc": "From the occurance of the pragma until the end of the template or\nany end of the enclosing section, HTML will not be escaped except\nin triple mustaches or when the '@' sigil is used.\n", "expected": "<&>\n&lt;&amp;&gt;\n&lt;&amp;&gt;\n---\n&lt;&amp;&gt;\n<&>\n<&>\n---\n<&>\n&lt;&amp;&gt;\n&lt;&amp;&gt;\n", "name": "The Unescaped Pragma", "template": "{{# section }}\n{{% unescaped }}\n{{html}}\n{{@html}}\n{{{html}}}\n{{/ section }}\n---\n{{html}}\n{{@html}}\n{{{html}}}\n---\n{{% unescaped }}\n{{html}}\n{{@html}}\n{{{html}}}\n"}]}