{"__ATTN__": "Do not edit this file; changes belong in the appropriate YAML file.", "depends_on": [], "overview": "A pragma specifies how a rendering engine should process its input.\nThey function as an in-band form of command-line option, specifying\nbehavior. In some cases they specify global behavior, while in other\ncases they only affect a local section. They do not perform any\naction in the language itself, but rather only a change in the\nbehavior of the rendering engine.\n\nPragmas are classifies according to the first word in their tag, where\na word is defined as any string of non-space characters. This\nspecification reserves and will only define pragmas whose first word\ncontains only lowercase characters.  Pragmas whose first word contains\nonly uppercase characters are reserved for particular implementations,\nwhile mixed-case first words are reserved for future use.\n", "tests": [{"data": {}, "desc": "The version-string is one or more strings of digits, separated by\nperiods; for example 1 or 1.0 or 1.0.1.  The first set of digits\nspecifies the major release of the spec expected by a template.\n\nIf the rendering engine cannot interpret templates according to\nthe specified version of the spec, it SHOULD halt operation.\n", "expected": "", "name": "The Version Pragma", "template": "{{% version 1}}"}, {"data": {}, "desc": "The spec-string is one or more strings of characters, separated by\nwhite-space.  Each string indicates a section of the spec that\nthe template expects the rendering engine to support.  Leading\n'~' characters are not required and are ignored if present; this\nallows optional portions of the spec to become required in later\nversions.  Required portions of the spec are allowed, as they may\nbecome optional in later versions.\n\nA rendering engine is allowed to define private specs.  These should\nuse only uppercase characters in their name.\n\nIf the rendering engine does not recognize a spec, it SHOULD halt\noperation.\n", "expected": "", "name": "The Requires Pragma", "template": "{{% requires sections partials }}"}, {"data": {}, "desc": "The message string should be displayed, if possible, on an out-\nof-band channel reserved for error messages.\n", "expected": "", "name": "The Warn Pragma", "template": "{{% warn *** DRAFT:  DO NOT DISTRIBUTE *** }}"}, {"data": {}, "desc": "The message string should be displayed, if possible, on an out-\nof-band channel reserved for error messages.  Next, the rendering\nengine SHOULD halt operation.\n", "expected": "", "name": "The Die Pragma", "template": "{{% die Required data is missing or not defined. }}"}]}